step-by-step/030-populate-database/020-soap/1100-типы-устройств/0100.xml

<?xml version="1.0" ?>
<!-- Создаем тип устройства -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceTypeUpdate xmlns:common=" http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" activeConfigId="0" configId="0" deviceEntitySpecId="0" entityId="0" entitySpecId="0" id="-1"
                  scriptId="0" title="Access + Accounting" uniqueInterfaces="false" xsi:type="ns5:inetDeviceType">
                <comment></comment>
                <config></config>
                <managmentType>0</managmentType>
                <serviceActivationType>0</serviceActivationType>
                <source>false</source>
                <interfaceList></interfaceList>
            </arg0>
        </ns5:deviceTypeUpdate>
    </S:Body>
</S:Envelope>
